Repository: 1453-osm/nv2app
Catalog: lib/l10n/app_*.arb
Languages: ar, tr

# appTitle
source: Prayer Times
ar: أوقات الصلاة
tr: Namaz Vakitleri

source: Location not selected
ar: الموقع غير محدد
tr: Konum seçilmedi

source: Loading...
ar: جاري التحميل...
tr: Yükleniyor...

# error
source: Error Occurred
ar: حدث خطأ
tr: Hata Oluştu

source: Retry
ar: إعادة المحاولة
tr: Tekrar Dene

source: No internet connection.
ar: لا يوجد اتصال بالإنترنت.
tr: İnternet bağlantısı yok.

source: Data not found.
ar: البيانات غير موجودة.
tr: Veri bulunamadı.

# serverError
source: Server error occurred. Please try again later.
ar: حدث خطأ في الخادم. يرجى المحاولة مرة أخرى لاحقاً.
tr: Sunucu hatası oluştu. Lütfen daha sonra tekrar deneyin.

# unknownError
source: Unknown error occurred.
ar: حدث خطأ غير معروف.
tr: Bilinmeyen hata oluştu.

source: GPS location not available
ar: موقع GPS غير متاح
tr: GPS konumu alınamadı

source: Qibla direction calculation failed
ar: فشل حساب اتجاه القبلة
tr: Kıble yönü hesaplanamadı

source: Location refresh failed
ar: فشل تحديث الموقع
tr: Konum yenilenemedi

source: Compass needs calibration
ar: يحتاج البوصلة إلى المعايرة
tr: Pusula kalibre edilmeli

source: Compass calibration required
ar: معايرة البوصلة مطلوبة
tr: Pusula kalibrasyonu gerekli

# cityNotFoundForLocation
source: City not found for your location
ar: لم يتم العثور على المدينة لموقعك
tr: Konumunuz için şehir bulunamadı

source: Content not found
ar: المحتوى غير موجود
tr: İçerik bulunamadı

# retryLowercase
source: retry
ar: إعادة المحاولة
tr: Tekrar dene

source: Automatic Location
ar: الموقع التلقائي
tr: Otomatik Konum

source: Getting Location...
ar: جاري الحصول على الموقع...
tr: Konum Alınıyor...

source: Notification Permission
ar: إذن الإشعارات
tr: Bildirim İzni

# notificationPermissionDescription
source: Required to send prayer time notifications.
ar: مطلوب لإرسال إشعارات أوقات الصلاة.
tr: Vakit bildirimleri gönderebilmek için gereklidir.

source: Location Permission
ar: إذن الموقع
tr: Konum İzni

# locationPermissionDescription
source: Required to show accurate prayer times based on location.
ar: مطلوب لعرض أوقات الصلاة الدقيقة بناءً على الموقع.
tr: Konuma göre doğru namaz vakitlerini göstermek için gereklidir.

# batteryOptimization
source: Remove from Battery Optimization (Android)
ar: إزالة من تحسين البطارية (Android)
tr: Pil Optimizasyonundan Çıkar (Android)

# batteryOptimizationDescription
source: Recommended for reliable background notifications/reminders.
ar: موصى به للإشعارات/التذكيرات الموثوقة في الخلفية.
tr: Arka planda güvenilir bildirim/hatırlatıcı için önerilir.

source: Granted
ar: ممنوح
tr: Verildi

source: Grant Permission
ar: منح الإذن
tr: İzin Ver

# locationHint
source: Let's select your location first so we can get accurate prayer times.
ar: دعنا نحدد موقعك أولاً حتى نتمكن من الحصول على أوقات الصلاة الدقيقة.
tr: Namaz vakitlerini doğru alabilmemiz için önce bulunduğun konumu seçelim.

source: Start
ar: ابدأ
tr: Başla

source: Monthly Prayer Times
ar: أوقات الصلاة الشهرية
tr: Aylık Namaz Vakitleri

# nextPrayerTime
source: {prayerName} time
ar: وقت {prayerName}
tr: {prayerName} vaktine

source: Calculating time
ar: جاري حساب الوقت
tr: Vakit hesaplanıyor

# imsakReminderRamadan
source: {timeText} until Imsak time. Last minutes for Suhur!
ar: متبقي {timeText} حتى وقت الإمساك. الدقائق الأخيرة للسحور!
tr: İmsak vaktine {timeText} kaldı. Sahur için son dakikalar!

# imsakReminder
source: {timeText} until Imsak time. Prepare for Fajr prayer.
ar: متبقي {timeText} حتى وقت الإمساك. استعد لصلاة الفجر.
tr: İmsak vaktine {timeText} kaldı. Fecr namazına hazırlanın.

# sunriseReminder
source: {timeText} until sunrise. Imsak time is ending.
ar: متبقي {timeText} حتى شروق الشمس. وقت الإمساك ينتهي.
tr: Güneş doğuşuna {timeText} kaldı. İmsak vakti sona eriyor.

# fridayPrayerReminder
source: {timeText} until Friday prayer. Don't forget to go to the mosque!
ar: متبقي {timeText} حتى صلاة الجمعة. لا تنس الذهاب إلى المسجد!
tr: Cuma namazına {timeText} kaldı. Camiye gitmeyi unutmayın!

# zuhrReminder
source: {timeText} until Zuhr prayer. Perform ablution and prepare.
ar: متبقي {timeText} حتى صلاة الظهر. توضأ واستعد.
tr: Öğle namazına {timeText} kaldı. Abdest alıp hazırlanın.

# asrReminder
source: {timeText} until Asr prayer. Prepare for the second prayer of the day.
ar: متبقي {timeText} حتى صلاة العصر. استعد للصلاة الثانية في اليوم.
tr: İkindi namazına {timeText} kaldı. Günün ikinci namazı için hazırlanın.

# iftarReminder
source: {timeText} until Iftar time! Maghrib prayer and Iftar time.
ar: متبقي {timeText} حتى وقت الإفطار! صلاة المغرب ووقت الإفطار.
tr: İftar vaktine {timeText} kaldı! Akşam namazı ve iftar zamanı.

# maghribReminder
source: {timeText} until Maghrib prayer. Maghrib time is approaching.
ar: متبقي {timeText} حتى صلاة المغرب. وقت المغرب يقترب.
tr: Akşam namazına {timeText} kaldı. Maghrib vakti yaklaşıyor.

# ishaReminder
source: {timeText} until Isha prayer. Prepare for the last prayer of the day.
ar: متبقي {timeText} حتى صلاة العشاء. استعد لآخر صلاة في اليوم.
tr: Yatsı namazına {timeText} kaldı. Günün son namazı için hazırlanın.

# prayerTimeReminder
source: {timeText} until prayer time.
ar: متبقي {timeText} حتى وقت الصلاة.
tr: Namaz vaktine {timeText} kaldı.

source: No saved location
ar: لا يوجد موقع محفوظ
tr: Kayıtlı konum yok

source: Customizable notifications
ar: إشعارات قابلة للتخصيص
tr: Özelleştirilebilir bildirimler

source: On time
ar: في الوقت المحدد
tr: Tam zamanında

source: Save
ar: حفظ
tr: Kaydet

source: Cancel
ar: إلغاء
tr: İptal

source: Language
ar: اللغة
tr: Dil

source: Automatic
ar: تلقائي

source: Theme Color
ar: لون المظهر
tr: Tema Rengi

source: Notifications
ar: الإشعارات
tr: Bildirimler

# continueButton
source: Continue
ar: تابع
tr: İlerle

source: Search city...
ar: ابحث عن مدينة...
tr: Şehir ara...

source: Search...
ar: بحث...
tr: Ara...

source: Imsak
ar: الإمساك

# gunes
source: Sunrise
ar: الشروق
tr: Güneş

# ogle
source: Zuhr
ar: الظهر
tr: Öğle

# ikindi
source: Asr
ar: العصر
tr: İkindi

# aksam
source: Maghrib
ar: المغرب
tr: Akşam

# yatsi
source: Isha
ar: العشاء
tr: Yatsı

# cuma
source: Friday
ar: الجمعة
tr: Cuma

# duaNotification
source: Prayer Notification
ar: إشعار الدعاء
tr: Dua Bildirimi

source: Date
ar: التاريخ
tr: Tarih

# religiousDays
source: Religious Days and Nights
ar: الأيام والليالي الدينية
tr: Dini Gün ve Geceler

# noReligiousDaysThisYear
source: No religious days found for this year.
ar: لم يتم العثور على أيام دينية لهذا العام.
tr: Bu yıl için dini gün bulunamadı.

source: Diyanet prayer times
ar: أوقات الصلاة من رئاسة الشؤون الدينية التركية
tr: Diyanet kaynaklı vakitler

# diyanetPrayerTimesSubtitle
source: Official sources, verified prayer time data
ar: مصادر رسمية، بيانات أوقات صلاة موثوقة
tr: Resmi kaynaklardan, doğrulanmış vakit verileriyle

# gpsQiblaCompass
source: GPS-based Qibla compass
ar: بوصلة القبلة القائمة على GPS
tr: GPS tabanlı kıble pusulası

# gpsQiblaCompassSubtitle
source: Deviation correction and live GPS tracking
ar: تصحيح الانحراف والتتبع المباشر عبر GPS
tr: Sapma düzeltmesi ve gps ile her an canlı

source: Rich theme options
ar: خيارات مظهر غنية
tr: Zengin tema seçenekleri

# richThemeOptionsSubtitle
source: Night/day compatible, unique design with color palettes
ar: متوافق مع الليل/النهار، تصميم فريد مع لوحات ألوان
tr: Gece/gündüz uyumlu, renk paletleriyle özgün tasarım

# customizableNotificationsTitle
source: Customizable notifications
ar: إشعارات قابلة للتخصيص
tr: Özelleştirilebilir bildirimler

# customizableNotificationsSubtitle
source: Flexible configuration tailored to you
ar: تكوين مرن مصمم خصيصاً لك
tr: Esnek yapılandırma ile sana özel

source: Custom
ar: مخصص
tr: Özel

# dynamicMode
source: Dynamic
ar: ديناميكي
tr: Dinamik

source: System
ar: النظام
tr: Sistem

source: Dark
ar: داكن
tr: Karanlık

# dynamicThemeDescription
source: Theme color will be set dynamically according to prayer time. A different color is used for each prayer time.
ar: سيتم تعيين لون المظهر ديناميكياً وفقاً لوقت الصلاة. يتم استخدام لون مختلف لكل وقت صلاة.
tr: Tema rengi namaz vaktine göre dinamik olarak ayarlanacaktır. Her namaz vakti için farklı bir renk kullanılır.

# blackThemeDescription
source: Pure black color is used. Provides battery savings on OLED screens.
ar: يتم استخدام اللون الأسود النقي. يوفر توفير البطارية على شاشات OLED.
tr: Tam siyah renk kullanılır. Oled ekranlarda pil tasarrufu sağlar.

# systemThemeDescription
source: On supported devices, colors are automatically adjusted according to the system color palette.
ar: على الأجهزة المدعومة، يتم تعديل الألوان تلقائياً وفقاً لوحة ألوان النظام.
tr: Desteklenen cihazlarda renkler sistem renk paletine göre otomatik olarak ayarlanır.

source: Auto Dark Mode
ar: الوضع الداكن التلقائي
tr: Oto Karartma

# january
source: Jan
ar: يناير
tr: Oca

# february
source: Feb
ar: فبراير
tr: Şub

# march
source: Mar
ar: مارس

# april
source: Apr
ar: أبريل
tr: Nis

source: May
ar: مايو

# june
source: Jun
ar: يونيو
tr: Haz

# july
source: Jul
ar: يوليو
tr: Tem

# august
source: Aug
ar: أغسطس
tr: Ağu

# september
source: Sep
ar: سبتمبر
tr: Eyl

# october
source: Oct
ar: أكتوبر
tr: Eki

# november
source: Nov
ar: نوفمبر
tr: Kas

# december
source: Dec
ar: ديسمبر
tr: Ara

# autoDarkModeDescription
source: Automatically switches to dark mode between 00:00 and sunrise time
ar: يتحول تلقائياً إلى الوضع الداكن بين 00:00 ووقت شروق الشمس
tr: 00:00 ile güneş vakti arasında otomatik olarak karanlık moda geçer

source: Close
ar: إغلاق
tr: Kapat

# kerahatTimeInfo
source: Kerahat Time Information
ar: معلومات وقت الكراهة
tr: Kerahat Vakti Bilgisi

source: hour
ar: ساعة
tr: saat

source: minute
ar: دقيقة
tr: dakika

# minuteShort
source: min
ar: د
tr: dk

source: second
ar: ثانية
tr: saniye

source: Kerahat Time
ar: وقت الكراهة
tr: Kerahat Vakti

source: Daily Content
ar: المحتوى اليومي
tr: Günlük İçerik

# dailyVerse
source: Verse of the Day
ar: آية اليوم
tr: Günün Ayeti

# dailyHadith
source: Hadith of the Day
ar: حديث اليوم
tr: Günün Hadisi

source: Qibla
ar: القبلة
tr: Kıble

source: Distance to Kaaba
ar: المسافة إلى الكعبة
tr: Kabe'ye mesafe

source: Calculating...
ar: جاري الحساب...
tr: Hesaplanıyor...

# calibrateDevice
source: Don't forget to calibrate your device
ar: لا تنس معايرة جهازك
tr: Cihazınızı kalibre etmeyi unutmayın

# minutesBefore
source: {minutes} minutes before
ar: قبل {minutes} دقيقة
tr: {minutes} dakika önce

# prayerTimesLoadError
source: Error loading prayer times for {date}: {error}
ar: حدث خطأ أثناء تحميل أوقات الصلاة لـ {date}: {error}
tr: {date} tarihinin namaz vakitleri yüklenirken hata oluştu: {error}

# localFilesClearError
source: Error clearing local files: {error}
ar: حدث خطأ أثناء مسح الملفات المحلية: {error}
tr: Local dosyalar temizlenirken hata oluştu: {error}

# countryListLoadError
source: Error loading country list: {error}
ar: حدث خطأ أثناء تحميل قائمة البلدان: {error}
tr: Ülke listesi yüklenirken hata oluştu: {error}

# stateListLoadError
source: Error loading state list: {error}
ar: حدث خطأ أثناء تحميل قائمة الولايات: {error}
tr: Eyalet listesi yüklenirken hata oluştu: {error}

# cityListLoadError
source: Error loading city list: {error}
ar: حدث خطأ أثناء تحميل قائمة المدن: {error}
tr: Şehir listesi yüklenirken hata oluştu: {error}

# locationSaveError
source: Error saving location: {error}
ar: حدث خطأ أثناء حفظ الموقع: {error}
tr: Konum kaydedilirken hata oluştu: {error}

# savedLocationLoadError
source: Error loading saved location: {error}
ar: حدث خطأ أثناء تحميل الموقع المحفوظ: {error}
tr: Kaydedilen konum yüklenirken hata oluştu: {error}

# locationInitError
source: Error initializing location: {error}
ar: حدث خطأ أثناء تهيئة الموقع: {error}
tr: Konum başlatılırken hata oluştu: {error}

# countrySearchError
source: Error searching countries: {error}
ar: حدث خطأ أثناء البحث عن البلدان: {error}
tr: Ülke arama yapılırken hata oluştu: {error}

# stateSearchError
source: Error searching states: {error}
ar: حدث خطأ أثناء البحث عن الولايات: {error}
tr: Eyalet arama yapılırken hata oluştu: {error}

# citySearchError
source: Error searching cities: {error}
ar: حدث خطأ أثناء البحث عن المدن: {error}
tr: Şehir arama yapılırken hata oluştu: {error}

# locationSelectError
source: Error selecting location: {error}
ar: حدث خطأ أثناء اختيار الموقع: {error}
tr: Konum seçilirken hata oluştu: {error}

# defaultLocationLoadError
source: Error loading default location: {error}
ar: حدث خطأ أثناء تحميل الموقع الافتراضي: {error}
tr: Varsayılan konum yüklenirken hata oluştu: {error}

# gpsLocationFetchError
source: Error fetching GPS location: {error}
ar: حدث خطأ أثناء جلب موقع GPS: {error}
tr: GPS konumu alınırken hata oluştu: {error}

# countryDataLoadError
source: Error loading country data: {error}
ar: حدث خطأ أثناء تحميل بيانات البلد: {error}
tr: Ülke verileri yüklenirken hata oluştu: {error}

# stateDataLoadError
source: Error loading state data: {error}
ar: حدث خطأ أثناء تحميل بيانات الولاية: {error}
tr: Eyalet verileri yüklenirken hata oluştu: {error}

# cityDataLoadError
source: Error loading city data: {error}
ar: حدث خطأ أثناء تحميل بيانات المدينة: {error}
tr: Şehir verileri yüklenirken hata oluştu: {error}

# locationSaveDataError
source: Error saving location data: {error}
ar: حدث خطأ أثناء حفظ بيانات الموقع: {error}
tr: Konum kaydedilirken hata oluştu: {error}

# savedLocationClearError
source: Error clearing saved location: {error}
ar: حدث خطأ أثناء مسح الموقع المحفوظ: {error}
tr: Kaydedilen konum temizlenirken hata oluştu: {error}

# notificationTestTitle
source: 🔔 Test Notification
ar: 🔔 إشعار تجريبي

# notificationTestBody
source: Notification system is working.
ar: نظام الإشعارات يعمل.

# notificationTestDuaTitle
source: 🤲 Test - Prayer of the Day
ar: 🤲 اختبار - دعاء اليوم

# notificationImsakTitle
source: Imsak Time
ar: وقت الإمساك

# notificationSunriseTitle
source: Sunrise
ar: شروق الشمس

# notificationZuhrTitle
source: Zuhr Prayer
ar: صلاة الظهر

# notificationAsrTitle
source: Asr Prayer
ar: صلاة العصر

# notificationMaghribTitle
source: Maghrib Prayer
ar: صلاة المغرب

# notificationIshaTitle
source: Isha Prayer
ar: صلاة العشاء

# notificationPrayerTimeTitle
source: Prayer Time
ar: وقت الصلاة

# notificationImsakImmediateRamadan
source: Imsak time has arrived! Suhur has ended, fasting has begun.
ar: حان وقت الإمساك! انتهى السحور، بدأ الصيام.

# notificationImsakImmediate
source: Imsak time has arrived. Fajr prayer time has begun.
ar: حان وقت الإمساك. بدأ وقت صلاة الفجر.

# notificationSunriseImmediate
source: Sun has risen! Imsak time has ended.
ar: طلعت الشمس! انتهى وقت الإمساك.

# notificationZuhrImmediateFriday
source: Friday prayer time has arrived! May Allah accept.
ar: حان وقت صلاة الجمعة! تقبل الله.

# notificationZuhrImmediate
source: Zuhr prayer time has arrived. May Allah accept.
ar: حان وقت صلاة الظهر. تقبل الله.

# notificationAsrImmediate
source: Asr prayer time has arrived. May Allah accept.
ar: حان وقت صلاة العصر. تقبل الله.

# notificationMaghribImmediateRamadan
source: Maghrib prayer time has arrived! Iftar time has come. 🌙
ar: حان وقت صلاة المغرب! حان وقت الإفطار. 🌙

# notificationMaghribImmediate
source: Maghrib prayer time has arrived. May Allah accept.
ar: حان وقت صلاة المغرب. تقبل الله.

# notificationIshaImmediate
source: Isha prayer time has arrived. May Allah accept.
ar: حان وقت صلاة العشاء. تقبل الله.

# notificationPrayerTimeImmediate
source: Prayer time has arrived. May Allah accept.
ar: حان وقت الصلاة. تقبل الله.

# notificationImsakAdvance
source: {timeText} until Imsak time
ar: متبقي {timeText} حتى وقت الإمساك

# notificationImsakAfter
source: {timeText} after Imsak
ar: بعد {timeText} من وقت الإمساك

# notificationSunriseAfter
source: {timeText} after Sunrise
ar: بعد {timeText} من شروق الشمس

# notificationSunriseAdvance
source: {timeText} until sunrise
ar: متبقي {timeText} حتى شروق الشمس

# notificationZuhrAdvanceFriday
source: {timeText} until Friday prayer
ar: متبقي {timeText} حتى صلاة الجمعة

# notificationZuhrAdvance
source: {timeText} until Zuhr prayer
ar: متبقي {timeText} حتى صلاة الظهر

# notificationAsrAdvance
source: {timeText} until Asr prayer
ar: متبقي {timeText} حتى صلاة العصر

# notificationMaghribAdvanceRamadan
source: {timeText} until Iftar time!
ar: متبقي {timeText} حتى وقت الإفطار!

# notificationMaghribAdvance
source: {timeText} until Maghrib prayer
ar: متبقي {timeText} حتى صلاة المغرب

# notificationIshaAdvance
source: {timeText} until Isha prayer
ar: متبقي {timeText} حتى صلاة العشاء

# notificationPrayerTimeAdvance
source: {timeText} until prayer time.
ar: متبقي {timeText} حتى وقت الصلاة.

# notificationFridayTitle
source: Friday Prayer
ar: صلاة الجمعة

# notificationFridayMessage15
source: {timeText} until Friday prayer. Time to head to the mosque!
ar: متبقي {timeText} حتى صلاة الجمعة. حان الوقت للذهاب إلى المسجد!

# notificationFridayMessage30
source: {timeText} until Friday prayer. Start preparing.
ar: متبقي {timeText} حتى صلاة الجمعة. ابدأ بالتحضير.

# notificationFridayMessageMore
source: {timeText} until Friday prayer. Don't forget to perform ablution and prepare.
ar: متبقي {timeText} حتى صلاة الجمعة. لا تنس الوضوء والتحضير.

# notificationDuaTitle
source: 🤲 Prayer of the Day
ar: 🤲 دعاء اليوم

# timeMinutes
source: {minutes} minutes
ar: {minutes} دقيقة

# timeHours
source: {hours} hours
ar: {hours} ساعة

# timeHoursMinutes
source: {hours} hours {minutes} minutes
ar: {hours} ساعة {minutes} دقيقة

# themeColorRavza
source: Ravza
ar: الروضة

# themeColorHarem
source: Harem
ar: الحرم

# themeColorAksa
source: Al-Aqsa
ar: الأقصى

# themeColorImsak
source: Imsak
ar: الإمساك

# themeColorGunes
source: Sunrise
ar: الشروق

# themeColorOgle
source: Zuhr
ar: الظهر

# themeColorIkindi
source: Asr
ar: العصر

# themeColorAksam
source: Maghrib
ar: المغرب

# themeColorYatsi
source: Isha
ar: العشاء

# soundDefault
source: Default
ar: افتراضي

# soundAdhan7
source: Arabic Adhan
ar: أذان عربي

# soundAdhan
source: Adhan
ar: أذان

# soundSela
source: Sela
ar: الصلوات

# soundHard
source: Hard Tone
ar: نغمة قوية

# soundSoft
source: Soft Tone
ar: نغمة ناعمة

# soundBird
source: Birds
ar: طيور

# soundAlarm
source: Alarm
ar: منبه

# soundSilent
source: Silent
ar: صامت

source: Silent mode after prayer
ar: الوضع الصامت بعد الصلاة

source: Silent mode duration
ar: مدة الوضع الصامت

# minutesAfter
source: {minutes} minutes after
ar: بعد {minutes} دقيقة

# silentModePermissionRequired
source: Silent mode permission required. Tap to open settings.
ar: مطلوب إذن الوضع الصامت. انقر لفتح الإعدادات.

# minutesAfterNotification
source: {minutes} minutes after
ar: بعد {minutes} دقيقة

# religiousDayDaysUntil
source: {days} days until {name}
ar: بقي {days} أيام على {name}

# religiousDayTomorrow
source: Tomorrow is {name}
ar: غداً {name}

# religiousDayToday
source: Blessed {name}
ar: مبارك عليكم {name}

# religiousDayTodayEid
source: Happy Eid
ar: عيد مبارك
